#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.repository_emb_template["stm32"].github_repository_file.files[".gitignore"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
          - # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-svc/.env.base.tftpl
          + # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/stm32-all/.env.base.tftpl
            
            CMakeCache.*
            CMakeFiles
            cmake_install.cmake
            *.swp
            build/
          + .env
        EOT
        id                  = "embedded-template-stm32/.gitignore"
        # (7 unchanged attributes hidden)
    }

  # module.repository_emb_template["stm32"].github_repository_file.files[".make/st.mk"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/stm32-all/.make/st.mk
            #
            BUILD_IMAGE_NAME     ?= ghcr.io/arrow-air/tools/arrow-stm32
            BUILD_IMAGE_TAG      ?= 1.0
          - OUTPUTS_PATH        ?= $(SOURCE_PATH)/out
          - ADDITIONAL_OPT      ?=
          + OUTPUTS_PATH         ?= $(SOURCE_PATH)/out
          + ADDITIONAL_OPT       ?=
            
            build_run = docker run \
          - 	--name=$(BUILD_IMAGE_NAME)-$@ \
          + 	--name=$(DOCKER_NAME)-$@ \
            	--rm \
          + 	--privileged \
            	--user `id -u`:`id -g` \
            	--workdir=/usr/src/app/ \
            	--env-file=$(SOURCE_PATH)/.env \
          + 	-v /dev/bus/usb:/dev/bus/usb \
            	$(ADDITIONAL_OPT) \
            	-v "$(SOURCE_PATH)/:/usr/src/app/" \
            	-t $(BUILD_IMAGE_NAME):$(BUILD_IMAGE_TAG) \
          - 	/bin/bash -c "$(1)"
          + 	/bin/sh -c "$(1)"
            
            build-docker-pull:
            	@echo docker pull -q $(BUILD_IMAGE_NAME):$(BUILD_IMAGE_TAG)
            
            .help-st:
            	@echo ""
          - 	@echo "$(SMUL)$(BOLD)$(GREEN)Build Container$(SGR0)"
          - 	@echo "  $(BOLD)build$(SGR0)       -- Run 'cmake'"
          + 	@echo "$(SMUL)$(BOLD)$(GREEN)STM32 Tools$(SGR0)"
          + 	@echo "  $(BOLD)stm32-build$(SGR0)       -- Run 'cmake'"
          + 	@echo "  $(BOLD)stm32-clean$(SGR0)       -- Removes the build/ directory"
          + 	@echo "  $(BOLD)stm32-flash$(SGR0)       -- Run 'st-flash write $(PROJECT_NAME).bin 0x08000000'"
          + 	@echo "  $(BOLD)stm32-probe$(SGR0)       -- Detects connected boards"
          + 	@echo "  $(BOLD)stm32-test$(SGR0)        -- Runs tests"
            
            .SILENT: build-docker-pull
            
            stm32-build: build-docker-pull
            	@echo "$(CYAN)Running cmake...$(SGR0)"
            	mkdir -p build
            	@$(call build_run,cmake -B build/)
            	@$(call build_run,cd build && make $(PROJECT_NAME))
            
          - stm32-flash: build-docker-pull build
          - 	@echo "$(YELLOW)Flashing tool not implemented. Skipping.$(SGR0)"
          + stm32-probe: build-docker-pull
          + 	@echo "$(YELLOW)Detecting STM32 boards...$(SGR0)"
          + 	@$(call build_run,cd build && st-info probe)
            
          + stm32-flash: build-docker-pull stm32-build
          + 	@echo "$(YELLOW)Flashing...$(SGR0)"
          + 	@$(call build_run,\
          + 	cd build && \
          + 	st-flash write $(PROJECT_NAME).bin 0x08000000 && \
          + 	st-flash reset)
          + 
            stm32-test:build-docker-pull
            	@echo "$(YELLOW)Testing framework not implemented. Skipping.$(SGR0)"
            
            stm32-clean: build-docker-pull
          - 	@echo "$(CYAN)Cleaning project...$(SGR0)"
          - 	@$(call build_run,cd build && make clean)
          + 	@echo "$(CYAN)Removing build directory...$(SGR0)"
          + 	@$(call build_run,rm -rf build/)
        EOT
        id                  = "embedded-template-stm32/.make/st.mk"
        # (7 unchanged attributes hidden)
    }

  # module.repository_emb_template["stm32"].github_repository_file.files["LICENSE"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            Copyright (c) 2023 Arrow DAO
            
            Redistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met:
            
            1. Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer.
            
            2. Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution.
            
            3. Neither the name of the copyright holder nor the names of its contributors may be used to endorse or promote products derived from this software without specific prior written permission.
            
            THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS “AS IS” AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
        EOT
      + file                = "LICENSE"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "embedded-template-stm32"
      + sha                 = (known after apply)
    }

  # module.repository_emb_template["stm32"].github_repository_file.files["Makefile"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/stm32-all/Makefile
            
            include .make/env.mk
            export
            
          - help: .help-base .help-cspell .help-markdown .help-editorconfig .help-commitlint
          + help: .help-base .help-cspell .help-markdown .help-editorconfig .help-commitlint .help-st
            build: stm32-build
          + flash: stm32-flash
            clean: stm32-clean
            test: stm32-test cspell-test md-test-links editorconfig-test
            tidy: editorconfig-tidy
            
            include .make/st.mk
            include .make/base.mk
            include .make/cspell.mk
            include .make/markdown.mk
            include .make/editorconfig.mk
            include .make/commitlint.mk
        EOT
        id                  = "embedded-template-stm32/Makefile"
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 3 to change, 0 to destroy.

```

</details>

*Pusher: @ServiceDog, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*